Tekla Open API Reference for Tekla Structures 2025
Rotation3D Properties
The Rotation3D type exposes the following members.
Properties
Name | Description
AxisX
Gets the X direction.
AxisY
Gets the Y direction.
AxisZ
Gets the Z direction.
Top
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace